{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Convolution1D", "config": {"batch_input_shape": [null, 667, 1], "W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dtype": "float32", "subsample_length": 1, "border_mode": "same", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling1D", "config": {"stride": 8, "pool_length": 8, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_4", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "glorot_uniform", "bias": true, "nb_filter": 128, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling1D", "config": {"stride": 8, "pool_length": 8, "trainable": true, "name": "maxpooling1d_2", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 512, "activity_regularizer": null, "trainable": true, "init": "lecun_uniform", "bias": true, "input_dtype": "float32", "input_dim": 1280, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "batch_input_shape": [null, 1280]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"p": 0.05, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "output_dim": 512, "activity_regularizer": null, "trainable": true, "init": "lecun_uniform", "bias": true, "input_dtype": "float32", "input_dim": 512, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "batch_input_shape": [null, 512]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"p": 0.05, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "output_dim": 64, "activity_regularizer": null, "trainable": true, "init": "lecun_uniform", "bias": true, "input_dtype": "float32", "input_dim": 512, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "batch_input_shape": [null, 512]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"p": 0.05, "trainable": true, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "output_dim": 3, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 64, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "batch_input_shape": [null, 64]}}]}